Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: The default type for an otherwise-unconstrained integer literal.
ja: 別途制約されない整数リテラルのための省略時型。

source: The default type for an otherwise-unconstrained string literal.
ja: 別途制約されない文字列リテラルのための省略時型。

source: The default type for an otherwise-unconstrained unicode scalar literal.
ja: 別途制約されないユニコードスカラーリテラルのための省略時型。

source: The default value for this limit is Int.max.
ja: この限界に対する省略時の値は、Int.maxです。

source: The default value is false.
ja: 省略時の値はfalseです。

source: The default value is Int.max.
ja: 省略時の値はInt.maxです。

source: The default value is true.
ja: 省略時の値は、trueです。

source: The default value to use if key doesn’t exist in the dictionary.
ja: keyが辞書の中に存在しないならば使うことになる省略時の値。

source: The destination Unicode encoding.
ja: 行き先ユニコードエンコーディング。

source: The dictionary literal is made up of one or more key-value pairs, separated by commas and surrounded with square brackets.
ja: 辞書リテラルは、コンマで区切られて角括弧で囲まれた１つ以上のキー値ペアで構成されます。

source: The dictionary wrapped in a data value.
ja: データ値の中にラップされる辞書。

source: The dictionary’s “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: 辞書の「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: The difference is that the AsyncIterator defines its next() method as async, which requires a caller to wait for the next value with the await keyword.
ja: その違いは、AsyncIteratorはそれのnext()メソッドをasyncとして定義することです、それは呼び出し側に次の値を待つようにawaitキーワードで要求します。

source: The difference needed to produce the receiver’s state from the parameter’s state.
ja: レシーバのもつ状態をパラメータのもつ状態から生成するのに必要とされる差異。

source: The difference needed to produce this collection’s ordered elements from the given collection.
ja: このコレクションのもつ順番付けられた要素をこの与えられたコレクションから生成するのに必要とされる差異。

source: The difference of the two arguments must be representable in the arguments’ type.
ja: ２つの引数の差は、引数の持つ型において表現可能でなければなりません。

source: The difference to be applied.
ja: 適用されることになる差異。

source: The distance between start and end.
ja: startとendの隔たり。

source: The distance between two indexes (always zero).
ja: ２つのインデックスの間の隔たり（常にゼロ）。

source: The distance from this pointer to end, in strides of the pointer’s Pointee type.
ja: このポインタからendまでの隔たり、ポインタのもつPointee型のストライドで。

source: The distance from this value to other.
ja: この値からotherまでの隔たり。

source: The distance to advance this value.
ja: この値を前進させる距離。

source: The distance to offset i.
ja: iを補う間隔。

source: The division operator (/) calculates the quotient of the division if rhs is nonzero.
ja: 除算演算子（/）は、rhsが非ゼロならばその除算の商を計算します。

source: The double wrapped in a data value.
ja: データ値の中にラップされるdouble。

source: The drop-first sequence produces whatever type of element its base iterator produces.
ja: drop-firstシーケンスは、それの基底イテレータが生み出す要素の型が何であろうとも生み出します。

source: The drop-while sequence produces whatever type of element its base sequence produces.
ja: drop-whileシーケンスは、それの基底シーケンスが生み出す要素の型が何であろうとも生み出します。

source: The dynamic type returned from type(of:) is a concrete metatype (T.Type) for a class, structure, enumeration, or other nonprotocol type T, or an existential metatype (P.Type) for a protocol or protocol composition P.
ja: type(of:)から返される動的型は、クラス、構造体、列挙、または他の非プロトコル型Tに対して具象メタタイプ（T.Type）、またはプロトコルやプロトコル合成Pに対して存在メタタイプ（P.Type）です。

source: The dynamic type, which is a metatype instance.
ja: 動的型、それはメタタイプインスタンスです。

source: The element at the specified index.
ja: 指定されたインデックスでの要素。

source: The element is the dropped value.
ja: この要素は、除外された値です。

source: The element that should be split upon.
ja: それで分離されることになる要素。

source: The element to append to the array.
ja: 配列に追加されることになる要素。

source: The element to check for containment.
ja: この要素が含まれるかを調べます。

source: The element to find in the asynchronous sequence.
ja: この要素を非同期シーケンスの中で見つけ出します。

source: The element to find in the sequence.
ja: このシーケンスにおいて見つける要素。

source: The element to repeat.
ja: 繰り返される要素。

source: The element to store in the collection.
ja: コレクションの中に格納することになる要素。

source: The element type of a dictionary: a tuple containing an individual key-value pair.
ja: 辞書の要素型：個々のキー値ペアを含んでいるタプル。

source: The elements at that index and later indices are shifted back to make room.
ja: そのインデックスおよび後のインデックスでの要素は、後ろに移って場所をあけます。

source: The elements of the range are the consecutive values from its lower bound up to, and including, its upper bound.
ja: この範囲に属する要素は、それの下側の境界の値から上側の境界まで、そしてそれを含めての連続した値です。

source: The elements of the resulting array are ordered according to the given predicate.
ja: 結果の配列の要素は、与えられた述部にしたがって並べられます。

source: The elements of the sequence are obtained by invoking next with a mutable state.
ja: シーケンスの要素は、 nextをある可変の状態とともに発動することによって入手されます。

source: The elements of this view are a concatenation of the elements of each sequence in the base.
ja: この見方での要素たちは、その基盤の中の各シーケンスのもつ要素の連結です。

source: The elements to append to the array.
ja: 配列に追加する要素。

source: The elements to append to the collection.
ja: これらの要素をコレクションへ追加します。

source: The encoder to write data to.
ja: データを書き込むエンコーダ。

source: The end index refers to the position one past the last element of a collection, so it doesn’t correspond with an element.
ja: 末尾インデックスは、あるコレクションの最後の要素を１つ過ぎた位置を参照します、それでそれはある要素に対応しません。

source: The error to throw from the continuation.
ja: その継続からスローされたエラー。

source: The error to throw or nil to signify termination.
ja: スローするエラーまたは終端を意味するnil。

source: The escapable copy of closure passed to body is only valid during the call to withoutActuallyEscaping(_:do:).
ja: closureの脱出可能コピーでbodyに渡されるものは、withoutActuallyEscaping(_:do:)への呼び出しの間に有効なだけです。

source: The example above responds to the property change by printing both the new and old values of the date.
ja: 上の例は、プロパティの変化に、日付の新旧の値の両方をプリントすることによって応答します。

source: The example below adopts the NSWindowDelegate protocol and implements its window(_:willUseFullScreenContentSize:) method:
ja: 下の例は、NSWindowDelegateプロトコルを採用します、そしてそれのwindow(_:willUseFullScreenContentSize:)メソッドを実装します：

source: The example below changes the myDate property by calling the updateDate method.
ja: 下の例は、myDateプロパティを、updateDateメソッドを呼び出すことによって変更します。

source: The example below creates an NSWindow and uses optional chaining to check that the window's delegate exists before sending a message to the delegate.
ja: 下の例は、NSWindowを作成して、オプショナル連鎖を使うことで、ウインドウの持つ委任先が存在することを、メッセージをその委任先に送る前に確認します。

source: The example below defines the MyObjectToObserve class with a property—myDate—that can be observed:
ja: 下の例は、MyObjectToObserveクラスを、監視されることが可能なプロパティ — myDate — で定義します：

source: The example below uses the NS_ERROR_ENUM macro to group error constants:
ja: 下の例は、NS_ERROR_ENUMマクロを使ってエラー定数をグループにまとめます：

source: The examples below demonstrate how to use withoutActuallyEscaping(_:do:) in conjunction with two common APIs that use escaping closures: lazy collection views and asynchronous operations.
ja: 下の例は、脱出クロージャ：遅延コレクションビューと非同期演算を使う２つのよくあるAPIと連係して、withoutActuallyEscaping(_:do:)を使う方法を実演します。

source: The exponent of the floating-point value.
ja: 浮動小数点値の指数。

source: The fact that all collections are finite guarantees the safety of many sequence operations, such as using the contains(_:) method to test whether a collection includes an element.
ja: すべてのコレクションが有限であるという事実は、多くのシーケンス演算、例えばcontains(_:)メソッドを使ってコレクションがある要素を含むかどうかテストすることなどの安全を保証します。

source: The file name to print with message if the assertion fails.
ja: 表明（アサーション）がうまくいかないならばmessageとともに出力するファイル名。

source: The file name to print with message if the precondition fails.
ja: 前提条件がうまくいかないならばmessageとともに出力するファイル名。

source: The file name to print with message.
ja: messageとともに出力するファイル名。

source: The filter sequence produces whatever type of element its base sequence produces.
ja: フィルタシーケンスは、それの基底シーケンスが生み出す要素の型が何であろうとも生み出します。

source: The final accumulated value.
ja: 最終的に蓄積された値。

source: The final example passes false for the omittingEmptySubsequences parameter, so the returned array contains empty strings where spaces were repeated.
ja: 最後の例はfalseをomittingEmptySubsequencesパラメータに渡します、なので返される配列は空白が繰り返されたところで空の文字列を含みます。

source: The final example passes true for the allowEmptySlices parameter, so the returned array contains empty strings where spaces were repeated.
ja: 最後の例はtrueをallowEmptySlicesパラメータに渡します、なので返される配列は空白が繰り返されたところで空の文字列を含みます。

source: The first element in the sequence is always first, and each successive element is the result of invoking next with the previous element.
ja: このシーケンスでの最初の要素は常にfirstです、そして続く要素それぞれはnextを前の要素とともに発動することの結果です。

source: The first element of a nonempty array is always at index zero.
ja: 空でない配列の最初の要素は、常にインデックス０です。

source: The first element of the collection if the collection is not empty; otherwise, nil.
ja: コレクションが空でないならばコレクションの最初の要素；そうでなければnil。

source: The first element of the collection.
ja: コレクションの最初の要素。

source: The first element of the dictionary is not necessarily the first element added.
ja: 辞書の最初の要素は、必ずしも追加された最初の要素ではありません。

source: The first element of the sequence that satisfies predicate, or nil if there is no element that satisfies predicate.
ja: predicate満たすシーケンスの最初の要素、またはpredicateを満たす要素が無いならばnil。

source: The first element to be returned from the sequence.
ja: このシーケンスから返されることになる最初の要素。

source: The first index where element is found.
ja: elementが見つけられたところの最初のインデックス。

source: The first key-value pair of the dictionary if the dictionary is not empty; otherwise, nil.
ja: 辞書が空でないならばこの辞書の最初のキー値ペア；そうでなければ、nil。

source: The first optional value that isn’t nil stops the chain and becomes the result of the whole expression.
ja: nilでない最初のオプショナル値は、連鎖を停止して、式全体の結果となります。

source: The first partition, numbers[..<p], is made up of the elements that are not greater than 30.
ja: 最初の区画、numbers[..<p]は、30より大きくない要素から構成されます。

source: The first sequence or collection to zip.
ja: 組み合わされる第１のシーケンスまたはコレクション。

source: The first use of split returns each word that was originally separated by one or more spaces.
ja: splitの最初の利用は、各単語を返します、それはもともと１つ以上の空白で隔てられています。

source: The first value to add.
ja: 加算する第１の値。

source: The first value to multiply.
ja: 掛け合わされる第１の値。

source: The first value to swap.
ja: 交換する１つ目の値。

source: The first version, present(completion:), has a return type of Void and takes a completion handler.
ja: 最初のバージョン、present(completion:)は、Voidの戻り型を持ち、そしてある完了ハンドラをとります。

source: The flat map sequence produces the type of element in the asynchronous sequence produced by the transform closure.
ja: このフラットマップシーケンスは、transformクロージャによって生み出される非同期シーケンスの中の要素の型を生み出します。

source: The flexible behavior of the AnyObject protocol is similar to Objective-C’s id type.
ja: AnyObjectプロトコルの柔軟な挙動は、Objective-Cのもつid型に似ています。

source: The floating-point types in the standard library are Float, Double, and Float80 where available.
ja: 標準ライブラリにおける浮動小数点型は、Float、Double、そして利用可能なところではFloat80です。

source: The floating-point value with the same sign and exponent as this value, but with a significand of 1.0.
ja: この値と同じ符号と指数を持つ浮動小数点値、しかし1.0の仮数を持ちます。

source: The following Objective-C property refers to a view controller that also acts a data source and delegate:
ja: 以下のObjective-Cプロパティは、あるビューコントローラを参照します、それはまたデータソースと委任先の役割を果たします：

source: The following characters are all lowercase:
ja: 以下の文字は全てローワーケースです：

source: The following characters are all uppercase:
ja: 以下の文字は全てアッパーケースです：

source: The following code declares values, an array of integers, and the addTenQuadratic() function, which adds ten more values to the values array on each call.
ja: 以下のコードは、整数の配列values、そして呼び出し毎に10個さらに値をvalues配列に加えるaddTenQuadratic()関数を宣言します。

source: The following code declares a perform(_:simultaneouslyWith:) function that uses a dispatch queue to execute two closures concurrently.
ja: 以下のコードはperform(_:simultaneouslyWith:)関数を宣言します、それはあるディスパッチキューを使って２つのクロージャを同時に実行します。

source: The following code declares a method that calculates the total of any sequence with AdditiveArithmetic elements.
ja: 以下のコードは、AdditiveArithmetic要素をもつ何らかのシーケンスの合計を計算するメソッドを宣言します。

source: The following code declares an allValues(in:match:) function that checks whether all the elements in an array match a predicate.
ja: 以下のコードは、配列のすべての要素がある述部に合致するかどうかを調べるallValues(in:match:)関数を宣言します。

source: The following code uses this method to test whether all the names in an array have at least five characters:
ja: 以下のコードは、このメソッドを使って、配列の中の全ての名前が少なくとも５つの文字を含むかどうかを試験します：

source: The following example accesses an element of an array through its subscript to print its value:
ja: 以下の例は、配列のある要素にそれの添え字によってアクセスしてそれの値を出力します。

source: The following example appends the elements of a Range<Int> instance to an array of integers:
ja: 次の例は、Range<Int>インスタンスからなるいくらかの要素を整数からなる配列に追加します：

source: The following example calculates the remainder of dividing 8.625 by 0.75:
ja: 以下の例は、8.625を0.75で割ることの余りを計算します：

source: The following example calculates the truncating remainder of dividing 8.625 by 0.75:
ja: 以下の例は、8.625を0.75で除算することの切り捨てられる余りを計算します。

source: The following example checks to see if imagePaths contains any paths in the "/glyphs" directory:
ja: 以下の例は、imagePathsが何らかのパスを"/glyphs"ディレクトリの中に含むかどうかを調べるために検査します。

source: The following example compares instances of the Int, UInt, and UInt8 types:
ja: 以下の例は、Int、UInt、そしてUInt8型のインスタンスを比較します：

source: The following example compares the date of the first moon landing with the release of David Bowie’s song “Space Oddity”:
ja: 以下の例は、最初の月面着陸の日付をデビッド・ボウイの歌「Space Oddity」のリリース日と比較します：

source: The following example compares tuples made up of 2 components:
ja: 以下の例は２つの構成要素から作り上げられるタプルを比較します：

source: The following example compares tuples made up of 3 components:
ja: 以下の例は、３つの構成要素で構成されるタプルを比較します：

source: The following example compares tuples made up of 4 components:
ja: 以下の例は４つの構成要素から作り上げられるタプルを比較します：

source: The following example compares tuples made up of 5 components:
ja: 以下の例は５つの構成要素から作り上げられるタプルを比較します：

source: The following example compares tuples made up of 6 components:
ja: 以下の例は６つの構成要素から作り上げられるタプルを比較します：

source: The following example copies bytes from the byteValues array into numbers, an array of Int32:
ja: 以下の例は、バイトをbyteValues配列から、numbersの配列Int32へとコピーします：

source: The following example copies the bytes of the numbers array into a buffer of UInt8:
ja: 以下の例は、numbers配列のバイトをUInt8のバッファへとコピーします：

source: The following example creates a Repeated<Int> collection containing five zeroes:
ja: 以下の例は、５つのゼロを含んでいるあるRepeated<Int>コレクションを作成します：

source: The following example creates a firstWord constant by using the prefix(while:) method to get a slice of the text string.
ja: 以下の例は、firstWord定数をprefix(while:)メソッドを使ってtext文字列のスライスを得ることによって作成します。

source: The following example creates a new character from the uppercase version of a string that only holds one character.
ja: 以下の例は、１つの文字を保持するだけのある文字列の大文字バージョンから、新しい文字列を作成します。

source: The following example creates a new dictionary and prints the value of a key found in the dictionary ("Coral") and a key not found in the dictionary ("Cerise").
ja: 以下の例は新しい辞書を作成して、辞書に見つかるキー（"Coral"）と辞書に見つからないキー（"Cerise"）の値を出力します

source: The following example creates a new dictionary using an array of strings as the keys and the integers in a countable range as the values:
ja: 以下の例は、文字列からなる配列をキーとしてそして可付番範囲の中の整数を値として、新しい辞書を作成します。

source: The following example creates an array of integers from an array literal, then appends the elements of another collection.
ja: 以下の例は、整数からなるある配列を配列リテラルから作成します、それから別のコレクションの要素を追加します。

source: The following example creates an iterator that counts up from the initial value of an integer x to 15:
ja: 以下の例はあるイテレータを作成します、それは初期値の整数xから15まで数え上げます：

source: The following example declares a function that calculates the length of the hypotenuse of a right triangle given its two perpendicular sides.
ja: 以下の例はある関数を宣言します、それは、それの２つの直角側を与えられる直角三角形の斜辺の長さを計算します。

source: The following example declares an array of names, and then creates a dictionary from that array by grouping the names by first letter:
ja: 以下の例は、いくらかの名前からなる配列を宣言します、それから名前を最初の文字でグループ分けすることによって、その配列から辞書を作成します。

source: The following example defines x as an instance of UInt8, an 8-bit, unsigned integer type.
ja: 以下の例は、xをUInt8のインスタンス、ある８ビットの、符号なし整数型として定義します。

source: The following example defines a printGenericInfo(_:) function that takes a generic parameter and declares the String type’s conformance to a new protocol P.
ja: 以下の例は、printGenericInfo(_:)関数を定義します、それは総称体パラメータを取り、String型のもつ準拠を新しいプロトコルPに宣言します。

source: The following example defines an IntegerRef type, an integer type with reference semantics.
ja: 以下の例は、あるIntegerRef型、参照意味論を持つ整数型を定義します。

source: The following example divides a value that is too large to be represented using a single Int instance by another Int value.
ja: 以下の例は、単一のIntインスタンスを使って表されるには大きすぎる値を、別のInt値によって割ります。

source: The following example enumerates the elements of an array.
ja: 以下の例は、ある配列の要素を列挙します。

source: The following example enumerates the elements of an array:
ja: 以下の例は、ある配列の要素を列挙します：

source: The following example obtains an index advanced four positions from a string’s starting index and then prints the character at that position.
ja: 以下の例は、文字列の開始インデックスから４位置進んだインデックスを取得して、それからその位置の文字を出力します。

source: The following example obtains an index advanced four positions from an array’s starting index and then prints the element at that position.
ja: 以下の例は、配列の始まりから４位置進んだインデックスを入手して、それからその位置での要素を出力します。

source: The following example prints a closed range of integers to a string:
ja: 続く例は、整数の完結範囲をある文字列へ出力します。

source: The following example prints a string, a closed range of integers, and a group of floating-point values to standard output:
ja: 以下の例は、ある文字列、整数の完結範囲、グループの浮動小数点値を標準出力に出力します：

source: The following example prints the debugging representation of a string, a closed range of integers, and a group of floating-point values to standard output:
ja: 以下の例は、ある文字列、整数の完結範囲、グループの浮動小数点値のデバッグ表現を標準出力に出力します：

source: The following example reverses the elements of an array of characters:
ja: 以下の例は、文字列からなる配列の要素を逆順にします：

source: The following example rounds a value using four different rounding rules:
ja: 以下の例はある値を４つの丸め規則を使って丸めます：

source: The following example rounds several values using this default rule:
ja: 以下の例はいくつかの値をこの初期設定での規則を使って丸めます：

source: The following example searches for the index of the number 40 in an array of integers, and then prints the suffix of the array starting at that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスで始まる配列の末尾を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, and including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、そしてそれを含めて、配列の冒頭を出力します。

source: The following example searches for the index of the number 40 in an array of integers, and then prints the prefix of the array up to, but not including, that index:
ja: 以下の例は、整数からなる配列において数40のインデックスを捜して、それからそのインデックスに至るまでの、しかしそれを含めずに、配列の冒頭を出力します。

source: The following example shows a Counter type that uses an inner iterator to monotonically generate Int values until reaching a howHigh value.
ja: 以下の例は、あるCounter型を示します、それはある内部イテレータを使ってInt値を、howHigh値に到達するまで単調に生成します。

source: The following example shows an IntParsingError enumeration that captures two different kinds of errors that can occur when parsing an integer from a string: overflow, where the value represented by the string is too large for the integer data type, and invalid input, where nonnumeric characters are found within the input.
ja: 以下の例は、IntParsingError列挙を示します、それが捕える（キャプチャ）のは、文字列から整数を構文解析（パース）する時に起こる可能性のある２つの異なる種類のエラー：文字列によって表される値が整数データ型に対して大きすぎるところのオーバーフロー、そして非数の文字が入力内に見つけられるところの無効な入力です。

source: The following example shows how NaN values operate in different contexts.
ja: 以下の例は、どのようにNaN値が異なる前後関係において作動するかを示します。

source: The following example shows how an array of strings can be joined to a single, comma-separated string:
ja: 以下の例は、どのように文字列からなる配列が単一の、コンマ区切りの文字列へと連結できるかを示します：

source: The following example shows how an iterator can be used explicitly to emulate a for-in loop.
ja: 次の例は、イテレータが明示的に使われてfor-inループの機能を真似る方法を示します。

source: The following example shows how extending and truncating work for nonnegative integers:
ja: 後に続く例は、非負数整数に対する拡張および切り詰め作業の方法を示します：

source: The following example shows how modifying the contents of the UnsafeMutableBufferPointer argument to body alters the contents of the array:
ja: 以下の例は、bodyへのUnsafeMutableBufferPointer引数の内容の修正が、配列の内容を改めることを示します：

source: The following example shows how the contains(_:) method can be used with an array of strings.
ja: 以下の例は、contains(_:)メソッドが文字列からなる配列で使われるのを示します。

source: The following example shows how to choose the first and last values for any duplicate keys:
ja: 以下の例は、あらゆる重複キーに対して最初と最後の値を選択する方法を示します：

source: The following example shows how to iterate over Counter, a custom AsyncSequence that produces Int values from 1 up to a howHigh value:
ja: 以下の例は、どのようにCounter、あるあつらえのAsyncSequenceでInt値を1からhowHigh値に至るまで生み出すもの、のすべてにわたって反復するかを示します：

source: The following example shows how you can bridge an Array instance to NSArray to use the write(to:atomically:) method.
ja: 以下の例は、どのようにあなたがArrayインスタンスをNSArrayへとブリッジして、write(to:atomically:)メソッドを使うかを示します。

source: The following example shows how you can iterate over the contents of the buffer pointer:
ja: 次の例は、どのようにあなたがバッファポインタの内容にわたって反復できるかを示します：

source: The following example shows the array literal initializer for a hypothetical OrderedSet type, which has setlike semantics but maintains the order of its elements.
ja: 以下の例は、仮設的なOrderedSet型のための配列リテラルイニシャライザを示します、それは集合的な意味論を持つけれどもそれの要素の順番を維持します。

source: The following example shows the dictionary literal initializer for a hypothetical CountedSet type, which uses setlike semantics while keeping track of the count for duplicate elements:
ja: 以下の例は、仮設的なCountedSet型のための辞書リテラルイニシャライザを示します、それは集合的な意味論を使う一方で重複する要素に対する総数を追跡し続けます。

source: The following example shows the results of rounding numbers using this rule:
ja: 以下の例は、この規則を使っての数の丸めの結果を示します：

source: The following example transcodes the UTF-8 representation of the string "Fermata 𝄐" into UTF-32.
ja: 以下の例は、文字列"Fermata 𝄐"のUTF-8表現をUTF-32にコード変換（トランスコード）します。

source: The following example updates the value for the 404 code to be simply “Not found” and removes the key-value pair for the 500 code entirely.
ja: 以下の例は、404コードの値を単純に「Not found」に更新して、500コードに対するキー値ペアをすっかり削除します。

source: The following example uses isTotallyOrdered(belowOrEqualTo:) to sort an array of floating-point values, including some that are NaN:
ja: 以下の例は、isTotallyOrdered(belowOrEqualTo:)を使って、NaNである何かを含んでいる、浮動小数点値の配列をソートします：

source: The following example uses a structure to represent an error when parsing an XML document, including the line and column numbers where the error occurred:
ja: 以下の例は、構造体を使ってXML書類をパースする時にエラーを表して、行およびコラム番号をエラーが生じたときに含めます：

source: The following example uses an enumeration of playing cards ranks, Rank, which ranges from ace (low) to king (high).
ja: 以下の例は、トランプのランクそれらからなるある列挙、Rankを使います、それはace（低）からking（高）までに及びます。

source: The following example uses indexed subscripting to update an array’s second element.
ja: 次の例は、インデックスでの添え字を使って、配列の２番目の要素を更新します。

source: The following example uses the drop(while:) method to skip over the positive numbers at the beginning of the numbers array.
ja: 以下の例は、drop(while:)メソッドを使って、正の数をnumbers配列の始まりで省きます。

source: The following example uses the first(where:) method to find the first negative number in an array of integers:
ja: 以下の例は、first(where:)メソッドを使って、整数の配列において最初の負数を見つけます：

source: The following example uses the negate() method to negate the value of an integer x:
ja: 以下の例はnegate()メソッドを使って、整数xの値を負にします：

source: The following example uses the prefix(while:) method to find the positive numbers at the beginning of the numbers array.
ja: 以下の例は、prefix(while:)メソッドを使って、正の数をnumbers配列の始まりで見つけます。

source: The following example uses the ~= operator to test whether an integer is included in a range of single-digit numbers:
ja: 以下の例は、~=演算子を使って、ある整数が一桁の数いくつかからなるある範囲に含まれるかどうか調べます：
